const MAP = {
  '-1': 'Internal Error',
  0: 'success',
  200: 'success',

  // 登录状态码
  4001: '无登录信息',
  4002: '用户不存在或未注册',
  4003: '密码错误',
  4004: '无加密信息',

  // 登出状态码
  4005: '未登录',
  4006: '登出失败',
  4007: '',
  400: '',


  4021: '文章参数错误',
  4022: '文章创建失败',
  4023: '文章ID无效',


  // 更新用户
  4041: '用户名不合法',
  4042: '密码无效',
  4043: '邮箱不合法',
  4044: '邮箱用户名已存在',
  4045: '密码长度太短',
  4046: '创建用户失败',
  4047: '修改用户失败',
  4048: '密码错误',
  4049: '修改用户密码失败',
  4050: '用户不存在',


}

module.exports = function getErrorCode(code) {
  return {
    code,
    message: MAP[code]
  }
}
